app/controllers/account_controller.rb

  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!
---
INSERT INTO `users` (`salt`, `updated_at`, `crypted_password`, `cell`, `remember_token_expires_at`, `is_admin`, `remember_token`, `login`, `email`, `created_at`) VALUES('5c6c2e4f32a1c8984cbc2d4a2e74503131986912', '2009-12-09 09:06:07', 'f584064a81a17773209986b0c81cc94bdf1dd163', NULL, NULL, NULL, NULL, 'andy', 'andy@gmail.com', '2009-12-09 09:06:07')